# -*- coding: utf-8 -*-

from enum import Enum


class SpaceConfig(Enum):
    ROOM_WITH_CLASS = {
        "客厅": {
            "sub_word": ["餐厅$", "玄关$", "客厅$", "起居(室)*"],  # "兼起居室功能卧室" 属于客厅和卧室
            "ignore_word": ["配套门厅", "入口门厅", "门厅$"]  # 配套门厅、入口门厅不是客厅
        },
        "客餐厅": {  # 定义同 "客厅"
            "sub_word": ["餐厅$", "玄关$", "客厅$", "起居(室)*"],  # "兼起居室功能卧室" 属于客厅和卧室
            "ignore_word": ["配套门厅", "入口门厅", "门厅$"]  # 配套门厅、入口门厅不是客厅
        },
        "餐厅": {
            "sub_word": ["餐厅$"],
            "ignore_word": ["配套门厅", "入口门厅", "门厅$"]
        },
        "玄关": {
            "sub_word": ["玄关$"],
            "ignore_word": []
        },
        "卧室": {
            "sub_word": ["客卧", "卧室", "客房", "老人房", "大孩房", "小孩房", "儿童房", "父母房",
                         "长辈房", "男孩房", "女孩房", "单人卧", "房间", "主卧", "双人卧", "主人房", "次卧"],
            "ignore_word": []
        },
        "主卧": {
            "sub_word": ["主卧", "双人卧", "主人房"],
            "ignore_word": []
        },
        "次卧": {
            "sub_word": ["次卧"],
            "ignore_word": []
        },
        "其他卧室": {
            "sub_word": ["客卧", "客房", "老人房", "大孩房", "小孩房", "儿童房", "父母房",
                         "长辈房", "男孩房", "女孩房", "单人卧"],
            "ignore_word": []
        },
        "卫生间": {  # 即住宅卫生间
            "sub_word": ["卫生间", "主卫", "客卫", "卫", "-W1", "-W2", "厕", "^干区$", "^湿区$", "W[1-4]$"],
            # 250216中W1表示套内公用卫生间，W2表示主卫；厕-252043
            "ignore_word": ["大样", "排气孔", "警卫"]  # 厨房排气孔是在图框的表格中遇到的，不是空间名称
        },
        "公共卫生间": {
            "sub_word": ["男.*卫", "女.*卫", "公.*卫", "无障碍.*卫", "男.*厕", "女.*厕", "公.*厕", "无障碍.*厕"],
            "ignore_word": []
        },
        "厨房": {
            "sub_word": ["厨房$", "厨E1", "厨[A-Z][1-9]?", "厨$", "厨房[1-9]$", "厨房\d\.\d+m", "KITCHEN", "厨房[a-zA-Z]$"],  # issue2053 "厨E1"
            "ignore_word": ["开放式厨房", "开敞式厨房", "西厨", "接厨房排水"]
        },
        "开放式厨房": {  # 开放式厨房不属于客厅类别，属于厨房类别，但为了入户门的搜索，单独为其创建一个类别
            "sub_word": ["开放式厨房", "开敞式厨房", "西厨"],
            "ignore_word": []
        },
        "阳台": {
            "sub_word": ["阳台.*\w*$", "露台.*\w*$", "平台", "阳台(\),\）)\d\.\d+", "(开敞|封闭)阳台"],
            "ignore_word": ["上空", "投影", "栏杆", "入户", "设备", "消防", "栏杆", "封严", "检修", "入口"]
        },  # 入户阳台不算做阳台，设备平台不是阳台，消防平台、入口平台不是阳台，阳台栏杆不是阳台，备注平台封严不是阳台
        "储藏室": {
            "sub_word": ["储藏", "储物", "贮藏"],
            "ignore_word": []
        },
        "储藏间": {
            "sub_word": ["储藏", "储物", "贮藏"],
            "ignore_word": []
        },
        "书房": {
            "sub_word": ["书房"],
            "ignore_word": []
        },
        "天井": {
            "sub_word": ["天井$", "采光井$"],
            "ignore_word": []
        },
        "家政间": {
            "sub_word": ["家政间"],
            "ignore_word": []
        },
        "洗衣房": {
            "sub_word": ["洗衣房"],
            "ignore_word": []
        },
        "空调板": {
            "sub_word": ["空调板"],
            "ignore_word": []
        },
        "电梯井": {
            "sub_word": ["电梯$", "客梯$", "货梯$", "DT", "担架梯$"],
            "ignore_word": ["DTM", "DTG1"]
        },
        "楼梯间": {
            "sub_word": ["楼梯", "LT"],
            "ignore_word": ["LTM", "LTC", "前室", "详图", "防滑", "上空", "客厅$", "餐厅$", "玄关$", "起居室", "大样",
                            "楼梯排烟", "^LT\d$", "^SLT-13$"]
        },  # 某些客厅空间有LT或楼梯文本 - 1303;303464图纸7的大空间中有楼梯构件"SLT-13"，但按顾问意思此楼梯不算楼梯间，特例
        "雨篷": {
            "sub_word": ["雨棚", "雨篷", "雨蓬"],
            "ignore_word": ["投影线", "板底标高", "边线"]
        },
        "风井": {
            "sub_word": ["JF", "PF", "SE", "MA", "送风井", "加压井", "补风", "补风井", "空调风井",
                         "空调管风井", "废气井", "排气道", "排气井", "风井", "进风井", "排风井", "尾气井",
                         "SF", "JS", "PF", "风室", "JY", "^风$", "^烟道$", "加压$"],
            "ignore_word": ["JFM", "送补风机", '^MAL$', "^JS机房$", "^GHSFM\d", "FJSQ"]
        },
        "排风井": {
            "sub_word": ["排风井", "通风井"],
            "ignore_word": []
        },
        "排烟井": {
            "sub_word": ["排烟井", "油烟井", "烟井", "PY", "PYY"],
            "ignore_word": ["PY机房"]
        },
        "水井": {
            "sub_word": ["水井", "水管井", "冷却水井", "冷却水管井", "冷冻水井", "冷冻水管井", "空调水井", "空调水管井", "SJ",
                         "^水$"],
            "ignore_word": ["^JSJ\d$", "^水井地漏", "^集水井$"]
        },
        # "电井": {  # TODO: 该空间仅指强弱电混合电井
        #     "sub_word": ["^电间$", "^电$", "^DJ$", ".*10kV.*井", "高压.*井", "中压.*井", "电缆井",
        #                  "^电井$", "强弱电井", "^QRD$"
        #                  ],  # "DD", "强电", "强电井", "QD", "EL", "ELE", "弱电", "弱电井", "RD", "ELV",
        #     "ignore_word": ["机房", "^强电CT", "QDD", "RDD", "RQD", "RDAL", "^防爆波电缆井$", "电井照明\d层", "强电间", "弱电间"]
        # },
        "强弱电井": {
            "sub_word": ["强弱电", "电气", "^电间$", "^电$", "^DJ$", ".*10kV.*井", "高压.*井", "中压.*井", "电缆井",
                         "^电井$", "强弱电井", "^QRD$"],
            "ignore_word": ["机房", "^强电CT", "QDD", "RDD", "RQD", "RDAL", "^防爆波电缆井$", "电井照明\d层", "强电间",
                            "弱电间", "电表", "弱电", "电梯", "电信间", "电视机房", "变配电", "变电(所)", "配电", "低压"]
        },
        "强电井": {
            "sub_word": ["^强电井$", "强电", "QD", "^EL$", "ELE", ".*10kV.*井", "高压.*井", "中压.*井"],  # v3.0需求，电表间从强电井、电井中剔除, "电井", "强弱电井"
            "ignore_word": ["机房", "QDD", "RQD", "强电间", "弱电", "强电箱", "电表", "电表间", "强弱电", "弱电", "电梯",
                            "电信间", "电视机房", "变配电", "变电(所)", "配电", "低压"]
        },
        "弱电井": {
            "sub_word": ["^弱电井$", "^RD$", "ELV", "^弱电$"],
            "ignore_word": ["电表", "强电", "电梯", "电信间", "电视机房", "弱电机房", "变配电", "变电(所)", "配电", "低压",
                            "机房", "RDD", "RDAL", "弱电间", "弱电箱"]  # "弱电", , "强弱电井"
        },
        "电表井": {
            "sub_word": ["电表", '^DB$'],  # v3.0需求，电表间对象化为电表井
            "ignore_word": []
        },
        "设备间": {
            "sub_word": ["设备间", "^设备$"],
            "ignore_word": []
        },
        "消防控制室": {
            "sub_word": ["^消防.*控制", "^消控室$", "消控中心", "消防值班室", "消防.*监控(室|中心)", "消防安保(室|中心)",
                         "安保消防(室|中心)"],
            "ignore_word": []
        },
        "弱电机房": {
            "sub_word": ["通信机房", "通讯机房", "弱电机房", "电话机房", "服务器机房", "联通机房", "设备间.*电信",
                         "移动机房", "电信机房", "进线间", "弱电间", "电信间", "电视机房"],
            "ignore_word": []
        },
        "配电房": {
            "sub_word": ["配电室", "变配电室", "变配电间", "配电房", "变配电房", "配电所", "变配电所", "公用变配电所",
                         "专用变配电所", "配电机房", "配电站", "公变所", "专变所", "公变房", "专变房", "公变电房", "专变电房",
                         "配变电房", "变电房", "变电间", "变电所", "变电室", "变压器室", "^物业电房$", "开关房",
                         "开闭所", "变压器房", "^配电间$"],
            "ignore_word": ["井"]
        },
        "开关房": {
            "sub_word": ["开关房", "开闭所", "高压房"],
            "ignore_word": []
        },
        "烧水间": {
            "sub_word": ["烧水间"],
            "ignore_word": []
        },
        "盥洗室": {
            "sub_word": ["盥洗室"],
            "ignore_word": []
        },
        "淋浴间": {
            "sub_word": ["淋浴间"],
            "ignore_word": []
        },
        "生活水泵房": {
            "sub_word": ["生活水泵房", "中水泵房"],
            "ignore_word": []
        },
        "消防水泵房": {
            "sub_word": ["^消防.*泵房$", "^消火栓.*泵房$", "^喷淋.*泵房$"],
            "ignore_word": []
        },
        "生活水箱间": {
            "sub_word": ["生活水箱间", "生活泵房"],
            "ignore_word": []
        },
        "消防水箱间": {
            "sub_word": ["消防水箱间"],
            "ignore_word": []
        },
        "烟道": {
            "sub_word": ["烟道"],
            "ignore_word": []
        },
        "风道": {
            "sub_word": ["风道"],
            "ignore_word": []
        },
        "仓库": {
            "sub_word": ["仓库"],
            "ignore_word": []
        },
        "食品仓库": {
            "sub_word": ["食品仓库"],
            "ignore_word": []
        },
        "贵重商品仓库": {
            "sub_word": ["贵重商品仓库"],
            "ignore_word": []
        },
        "电气机房": {
            "sub_word": ["电气机房", "配电房", "弱电机房", "网络机房", "配电室", "^配电间$", "配电机房", "配电站", "公变所",
                         "专变所", "公变房", "专变房", "变电房", "变电间", "变电所", "变电室", "变压器室", "开关房", "开闭所",
                         "^消防.*控制", "^消控室$", "消控中心", "消防值班室", "消控室", "电话机房", "进线间", "通信机房",
                         "服务器机房", "联通机房", "移动机房", "电信机房", "电信间", "消防.*监控(室|中心)", "消防安保(室|中心)",
                         "安保消防(室|中心)", "^变压器房$"],
            "ignore_word": []
        },
        "配电间": {
            "sub_word": ["^配电间$", "强电间"],
            "ignore_word": []
        },
        "消防电梯机房": {
            "sub_word": ["消防.*电梯.*机房"],
            "ignore_word": []
        },
        "电梯机房": {
            "sub_word": ["电梯.*机房", "客梯.*机房", "货梯.*机房", "DT.*机房", "担架梯.*机房"],
            "ignore_word": []
        },
        "发电机房": {
            "sub_word": ["发电机房", "^柴发$", "^柴发机房$"],
            "ignore_word": ["进风", "^发电机房排烟井$", "^\(发电机房\)$"]
        },
        "化粪池": {
            "sub_word": ["化粪"],
            "ignore_word": []
        },
        "垃圾房": {
            "sub_word": ["垃圾房"],
            "ignore_word": []
        },
        "换热站": {
            "sub_word": ["换热"],
            "ignore_word": []
        },
        "泵房": {
            "sub_word": ["泵房"],
            "ignore_word": []
        },
        "库房": {
            "sub_word": ["库房"],
            "ignore_word": []
        },
        "机房": {  # 泛机房空间
            "sub_word": ["机房"],
            "ignore_word": ['机房地面', "底距机房完成面"]
        },
        "通信机房": {
            "sub_word": ["通信机房", "通讯机房", "电话机房", "服务器机房", "联通机房", "移动机房", "电信机房", "弱电机房",
                         "^消防.*控制", "^消控室$", "消控中心", "消防值班室", "消防.*监控(室|中心)", "消防安保(室|中心)",
                         "安保消防(室|中心)", "进线间"],
            "ignore_word": []
        },
        "报警阀间": {
            "sub_word": ["报警阀间$"],
            "ignore_word": []
        },
        "大堂": {
            "sub_word": ["大堂", "门厅", "大厅", "前厅"],
            "ignore_word": ["大堂屋面", "大堂上空"]
        },
        "大厅": {
            "sub_word": ["大厅"],
            "ignore_word": []
        },
        "前厅": {
            "sub_word": ["前厅"],
            "ignore_word": []
        },
        "外廊": {
            "sub_word": ["外廊"],
            "ignore_word": []
        },
        "走道": {
            "sub_word": ["走道", "过道", "走廊", "公共走道"],
            "ignore_word": ["^走道地漏"]
        },
        "衣帽间": {
            "sub_word": ["衣帽间", "更衣"],
            "ignore_word": []
        },
        "连廊": {
            "sub_word": ["连廊$", "廊道$"],
            "ignore_word": []
        },
        "回车场": {
            "sub_word": ["回车场"],
            "ignore_word": []
        },
        "调压站": {
            "sub_word": ["调压站"],
            "ignore_word": []
        },
        "电缆井": {
            "sub_word": ["^防爆波电缆井$"],
            "ignore_word": []
        },
        "水表井": {
            "sub_word": ["水表井"],
            "ignore_word": []
        },
        "管道井": {
            "sub_word": ["管道井"],
            "ignore_word": []
        },
        "走廊": {
            "sub_word": ["走廊"],
            "ignore_word": ["^接走廊排水$", "^走廊排水地漏$"]
        },
        "锅炉房": {
            "sub_word": ["锅炉房"],
            "ignore_word": []
        },
        "避难间": {
            "sub_word": ["避难间"],
            "ignore_word": []
        },
        "露台": {
            "sub_word": ["露台"],
            "ignore_word": []
        },
        "附建公共用房": {
            "sub_word": ["物业管理用房", "社区综合办", "社区服务站", "图书馆", "党员活动室"],
            "ignore_word": ["商业内部楼梯"]
        },
        "商业服务网点": {
            "sub_word": ["菜市场", "菜场", "健身", "餐饮", "银行", "邮政", "邮局", "支行", "营业厅",
                         "储蓄所", "理发店", "百货店", "副食店", "粮店", "洗衣店", "药店", "洗车店",  "商[业铺服店]"],
            "ignore_word": [".*仓库"]
        },
        "文化服务中心": {
            "sub_word": ["文化(服务中心|活动中心|娱乐中心|活动室)"],
            "ignore_word": []
        },
        "社区服务中心": {
            "sub_word": ["社区服务中心"],
            "ignore_word": []
        },
        "养老服务用房": {
            "sub_word": ["养老服务用房", "居家养老", "社区养老"],
            "ignore_word": []
        },
        "街道办事处": {
            "sub_word": ["街道办事处", "居委会"],
            "ignore_word": []
        },
        "消防风机房": {
            "sub_word": ["(消防风机|排烟|补风机|正压|加压).*房$"],
            "ignore_word": ["井", "排烟机房", "正压机房", "加压机房"]
        },
        "热水机房": {
            "sub_word": ["热水机房$"],
            "ignore_word": []
        },
        "普通风机房": {
            "sub_word": ["(风机|空调机|新风机|排风|送风|进风).*房$", "(正压|加压)机房"],
            "ignore_word": ["消防", "排烟", "补风", "正压", "加压", "井"]
        },
        "排烟机房": {
            "sub_word": ["排烟机房", "排烟机", "风机房", "消防机房"],
            "ignore_word": []
        },
        "加压机房": {
            "sub_word": ["加压机房", "加压风机", "送风机房", "正压机房", "^风机房$"],
            "ignore_word": []
        },
        "排风机房": {
            "sub_word": ["^排风机房$", "^风机房$"],
            "ignore_word": []
        },
        "储油间": {
            "sub_word": ["储油间", "油箱间"],
            "ignore_word": []
        },
        "基地车行出入口": {
            "sub_word": ["基地车行出入口"],
            "ignore_word": []
        },
        "基地人行出入口": {
            "sub_word": ["基地人行出入口"],
            "ignore_word": []
        },
        "防火分区": {
            "sub_word": ["防火分区"],
            "ignore_word": []
        },
        "门廊": {
            "sub_word": ["门廊"],
            "ignore_word": []
        },
        "设备用房": {
            "sub_word": ["设备用房"],
            "ignore_word": []
        },
        "贮存食品库房": {
            "sub_word": ["贮存食品库房"],
            "ignore_word": []
        },
        "变电站": {
            "sub_word": ["变电站"],
            "ignore_word": []
        },
        "变配电室": {
            "sub_word": ["变配电", "变电"],
            "ignore_word": []
        },
        "入口平台": {
            "sub_word": ["入口平台"],
            "ignore_word": []
        },
        "合用前室": {
            "sub_word": ["合用前室"],
            "ignore_word": []
        },
        "门斗": {
            "sub_word": ["门斗"],
            "ignore_word": []
        },
        "过廊": {
            "sub_word": ["过廊"],
            "ignore_word": []
        },
        "过厅": {
            "sub_word": ["过厅"],
            "ignore_word": []
        },
        "空中花园": {
            "sub_word": ["空中花园"],
            "ignore_word": []
        },
        "电信间": {
            "sub_word": ["电信间"],
            "ignore_word": []
        },
        "强电间": {
            "sub_word": ["强电间"],
            "ignore_word": []
        },
        "弱电间": {
            "sub_word": ["弱电间"],
            "ignore_word": []
        },
        "设备平台": {
            "sub_word": ["设备平台"],
            "ignore_word": []
        },
        "接线间": {
            "sub_word": ["接线间"],
            "ignore_word": []
        },
        "独立前室": {
            "sub_word": ["独立前室"],
            "ignore_word": []
        },
        "消防电梯前室": {
            "sub_word": ["消防前室"],
            "ignore_word": []
        },
        "屋面": {
            "sub_word": ["屋面$"],
            "ignore_word": ["大堂屋面"]
        },
        "水暖井": {
            "sub_word": ["水暖井", "^水暖$"],
            "ignore_word": []
        },
        "暖井": {
            "sub_word": ["^暖井$", "^N$", "^暖通$", "^暖通井$", "^暖水井$", "^采暖井$", "^暖$"],
            "ignore_word": ["水暖", "地暖", "暖气", "采暖"]
        },
        "工具间": {
            "sub_word": ["工具间"],
            "ignore_word": []
        },
        "热计量间": {
            "sub_word": ["热计量间"],
            "ignore_word": []
        },
        "空调机房": {
            "sub_word": ["空调机房", "AHU"],
            "ignore_word": []
        },
        "凹廊": {
            "sub_word": ["凹廊"],
            "ignore_word": []
        },
        "电梯厅": {
            "sub_word": ["电梯厅", "候梯厅", "侯梯厅"],
            "ignore_word": []
        },
        "大堂屋面": {
            "sub_word": ["大堂屋面"],
            "ignore_word": []
        },
        "信报间": {
            "sub_word": ["信报间"],
            "ignore_word": [],
        },
        "保姆间": {
            "sub_word": ["保姆间", "保姆房", "工人房"],
            "ignore_word": [],
        },
        "菜地": {
            "sub_word": ["菜地"],
            "ignore_word": [],
        },
        "私家电梯": {
            "sub_word": ["私家电梯"],
            "ignore_word":[],
        },
    }

    ROOM_LIST = [

        # **** 套内空间 ****

        # 客厅空间相关 - 已分组
        "餐厅",
        "玄关",
        "客厅",
        "起居室",
        # 阳台相关 - 已分组
        "阳台\d*$",
        "阳台(\),\）)\d\.\d+",
        "(开敞|封闭)阳台",
        "露台",
        "平台",
        # 卧室相关 - 已分组
        "卧室",
        "主卧",
        "主卧室",
        "次卧",
        "房间",
        "客卧",
        "客房",
        "老人房",
        "长辈房",
        "主人房",
        "父母房",
        "大孩房",
        "小孩房",
        "男孩房",
        "女孩房",
        "儿童房",
        "衣帽间",
        "更衣",
        "单人卧",
        "双人卧",
        # 卫生间相关 - 已分组
        "卫生间",
        "主卫",
        "客卫",
        "-W1",  # 250216中表示套内公用卫生间
        "-W2",  # 250216中表示主卫
        "^干区$",
        "^湿区$",
        "W[1-4]$",
        "卫",
        "男.*卫",
        "女.*卫",
        "公.*卫",
        "无障碍.*卫",
        "厕",  # 252043
        "男.*厕",
        "女.*厕",
        "公.*厕",
        "无障碍.*厕",
        # 厨房相关 - 已分组
        "厨房$",
        "厨房[1-9]$",
        "厨房[a-zA-Z]$",
        "厨$",
        "厨E1$",  # 2053 "厨E1"
        "KITCHEN",
        "厨[A-Z][1-9]?",
        "厨房\d\.\d+m",  # 出图二次邀测厨房文本带有面积，添加匹配项
        # 套内其他空间相关 - 已分组
        "书房",
        # 储物室相关 - 已分组
        "储藏",
        "储藏间",
        "储藏室",
        "储物",
        "贮藏",
        # 其他 - 已分组
        "天井$",
        "采光井",
        "洗衣房",
        "^家政间$",

        # **** 公共空间 ****

        # 电梯井相关 - 已分组
        "客梯$",
        "货梯$",
        "电梯$",
        "DT",
        "担架梯$",
        # 楼梯间相关 - 已分组
        "楼梯$",
        "楼梯间$",
        "LT",
        # 其他公共空间相关 - 未分组
        "大堂",  # 大堂管理不是空间名称
        "大厅",
        "门厅",
        "前厅",
        "走廊$",
        "门廊$",
        "外廊$",
        "连廊$",
        "走道$",
        "过道$",
        "廊道$",
        "过廊$",
        "前室",
        "出口",
        "入口",
        "候梯厅$",
        "侯梯厅$",
        "电梯厅$",
        "门斗",  # 252273
        "过廊",
        "过厅",
        "信报间",
        # 雨棚相关 - 已分组
        "雨棚",
        "雨篷",
        "雨蓬",
        # 其他空间相关 - 未分组
        "空中花园",
        "空调板",  # 为规则62增加
        "报警阀间$",
        "凹廊",

        # **** 功能空间 ****

        # 设备相关 - 已分组
        "设备间",  # 268743
        "^设备$",
        # 消控相关 - 已分组
        "^消防.*控制",
        "^消控室$",
        "消控中心",
        "消防值班室",
        "消防.*监控(室|中心)",
        "消防安保(室|中心)",
        "安保消防(室|中心)",
        # 其他机房相关 - 已分组
        "机房",
        "电气机房",
        "电梯.*机房",
        "客梯.*机房",
        "货梯.*机房",
        "DT.*机房",
        "担架梯.*机房",
        "发电机房",
        "网络机房",
        "^柴发$",
        "^柴发机房$",
        "^变压器房$",
        # 热水机房
        "热水机房$",
        # 一部分弱电机房相关 - 已分组
        "通信机房",
        "通讯机房",
        "弱电机房",
        "电视机房",
        "电话机房",
        "服务器机房",
        "联通机房",
        "移动机房",
        "电信机房",
        "进线间",
        "电信间",
        "设备间.*电信",
        # 加压机房
        "加压机房",
        "加压风机",
        "送风机房",
        "正压机房",
        # 配电房相关 - 已分组
        "配电室",
        "变配电室",
        "^配电间$",
        "变配电间",
        "配电房",
        "变配电房",
        "配电所",
        "^物业电房$",
        "变配电所",
        "公用变配电所",
        "专用变配电所",
        "配电机房",
        "配电站",
        "公变所",
        "专变所",
        "公变房",
        "专变房",
        "公变电房",
        "专变电房",
        "配变电房",
        "变电房",
        "变电间",
        "变电所",
        "变电室",
        "变压器室",
        "开闭所",
        "开关",
        "开关房",
        "高压房",
        "接线间",
        # 用水室相关 - 已分组
        "盥洗室",
        "淋浴间",
        "泵房",
        # 生活相关 - 已分组
        "化粪",
        "垃圾房",
        # 管道空间相关 - 已分组
        "烟道",
        "风道",
        # 仓库空间相关 - 已分组
        "仓库",
        "食品仓库",
        "贵重商品仓库",
        # 电井相关 - 已分组
        ".*10kV.*井",
        "高压.*井",
        "中压.*井",
        "电缆",
        "电缆井",
        "强电",
        "弱电",
        "强电井",
        "强弱电井",
        "弱电井",
        "电井",
        "电气",
        "QD",
        "RD",
        "DJ$",
        "DD",
        "EL",
        "ELE",
        "ELV",
        "^电$",
        "电间",
        "弱电间",
        "强电间",
        "电表间",
        "电表井",
        # 风井相关 - 已分组
        "JF",
        "PF",
        "SE",
        "MA",
        "PY",
        "PYY",
        "送风井",
        "加压",
        "加压井",
        "补风",
        "补风井",
        "空调风井",
        "空调管风井",
        "废气井",
        "排气道",
        "排气井",
        "风井",
        "进风井",
        "排风井",
        "通风井",
        "尾气井",
        "SF",
        "JS",
        "PF",
        "^F$",
        "^风$",
        "风室",
        "JY",
        # 水井相关 - 已分组
        "^水$",
        "水井",
        "水管井",
        "冷却水井",
        "冷却水管井",
        "冷冻水井",
        "冷冻水管井",
        "空调水井",
        "空调水管井",
        "SJ",
        # 其他空间相关 - 已分组
        "换热",
        "库房",
        "烧水间",
        "生活水泵房",
        "中水泵房",
        "生活水箱间",
        "生活泵房",
        "消防水箱间",
        "^消防.*泵房$",
        "^消火栓.*泵房$",
        "^喷淋.*泵房$",
        "回车场",
        "调压站",
        "水表井",
        "管道井",
        "锅炉房",
        "避难间",
        # 附建公共用房
        "物业管理用房",
        "社区综合办",
        "社区服务站",
        "图书馆",
        "党员活动室",
        "物业",
        # 消防风机房
        "消防风机房",
        "排烟",
        "补风机",
        "正压",
        # 普通风机房
        "^风机房$",
        "排风机房",
        "空调机房",
        "AHU",
        "新风机房",
        "排风",
        "送风",
        "进风机房",
        # 1230新增的空间关键字
        "储油间",
        "油箱间",
        "基地车行出入口",
        "基地人行出入口",
        "防火分区",
        "商业服务网点",
        "商业网点",
        "设备用房",
        "贮存食品库房",
        "变电站",
        "变配电",
        "入口平台",
        "排烟井",
        "油烟井",
        "烟井",
        "水暖井",
        "^水暖$",
        "^暖井$",
        "^N$",
        "^暖通$",
        "^暖通井$",
        "^暖水井$",
        "^采暖井$",
        "^暖$",
        # 排烟机房
        '排烟机房',
        "排烟机",
        "风机房",
        "消防机房",
        "设备平台",
        "屋面",
        "工具间",
        "热计量间",
        # 商业服务网点
        "邮[政局]",
        "储蓄所",
        "理发店",
        "百货店",
        "副食店",
        "粮店",
        "洗衣店",
        "药店",
        "洗车店",
        "餐饮",
        "商[业铺服店]",
        "菜市场",
        "菜场",
        "健身",
        "银行",
        "支行",
        "营业厅",
        # 文化服务中心
        "文化服务中心",
        "文化活动中心",
        "文化娱乐中心",
        "文化活动室",
        # 社区服务中心
        "社区服务中心",
        # 养老服务用房
        "养老服务用房",
        "居家养老",
        "社区养老",
        # 街道办事处
        "街道办事处",
        "居委会",
        "保姆*",
        "工人房",
        "菜地",
    ]

    IGNORE_ROOM_WORD_LIST = ["DTM", "LTM", "LTC", "卫生间大样", "门卫", "卫生间隔断详二次装修设计", "型套内楼梯", "风井至楼梯板底",
                             "商业裙房墙身大样", "通气管自储油间引出", "注油管终端留口于油箱间", "车库和油箱间各设置可手自", "中间层空调板上预留",
                             "入户阳台"]  # 目前入户阳台没有实际用途，且在存在入户阳台的地方影响户的识别，暂过滤该文本

    # 判断入户门时，联通这些空间的门需要排除
    IGNORE_OTHER_SPACE_LIST = ['卧室', '卫生间', '厨房', '阳台', '书房', '储藏', '储物', '衣帽间', '贮藏', '天井', '套内楼梯间']

    # 空调室内机所在空间，for rule21 & utils.get_air_conditioner_type
    AC_INDOOR_ROOM_LIST = ['卧室', '客厅', '厨房', '卫生间', '书房', '衣帽间', '储藏室', '空中花园', '附建公共用房']

    ROOM_AREA_THRES = {
        # "卫生间": 50, # 卫生间和客厅相连
        "阳台": 23,  # 二次邀测转角型阳台面积较大，达到22平方
        "风井": 15,
        "水井": 15,
        "电井": 15,
        "强电井": 15,
        "弱电井": 15,
        "风道": 15,
        "烟道": 15,
        # "厨房": 50, # 厨房和客厅有可能相连
        "储藏室": 8,
    }
